In [1]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame

In [2]:
ser1 = Series(data = np.arange(5,8),
             index=['x','y','z'])
ser1

x    5
y    6
z    7
dtype: int32

In [3]:
ser1[0]

5

In [4]:
ser1['x']

5

In [5]:
ser1['x':'z'] #z de dahil ediyor

x    5
y    6
z    7
dtype: int32

In [7]:
ser1[['x','z']]

x    5
z    7
dtype: int32

In [8]:
ser1

x    5
y    6
z    7
dtype: int32

In [9]:
ser1 > 6

x    False
y    False
z     True
dtype: bool

In [10]:
ser1[ser1 > 6]

z    7
dtype: int32

In [11]:
ser1[ser1 > 6] = ser1*2

In [12]:
ser1

x     5
y     6
z    14
dtype: int32

In [15]:
df = DataFrame(data=np.arange(20).reshape(5,4),
              index=['x','y','z','m','n'],
              columns=['A','B','C','D'])
df

    A   B   C   D
x   0   1   2   3
y   4   5   6   7
z   8   9  10  11
m  12  13  14  15
n  16  17  18  19

In [16]:
df['A']

x     0
y     4
z     8
m    12
n    16
Name: A, dtype: int32

In [17]:
df[['A','D']]

    A   D
x   0   3
y   4   7
z   8  11
m  12  15
n  16  19

In [18]:
df

    A   B   C   D
x   0   1   2   3
y   4   5   6   7
z   8   9  10  11
m  12  13  14  15
n  16  17  18  19

In [19]:
df.loc['z']

A     8
B     9
C    10
D    11
Name: z, dtype: int32

In [21]:
df.iloc[2] #satırın sırasını vermemiz gerekiyor.

A     8
B     9
C    10
D    11
Name: z, dtype: int32

In [22]:
df.loc[['x','n']]

    A   B   C   D
x   0   1   2   3
n  16  17  18  19

In [23]:
df.iloc[[0,-1]] #ilk ve son degerdeki satıra ulastık

    A   B   C   D
x   0   1   2   3
n  16  17  18  19

In [25]:
df.loc['m','C']

14

In [26]:
df > 6

       A      B      C      D
x  False  False  False  False
y  False  False  False   True
z   True   True   True   True
m   True   True   True   True
n   True   True   True   True

In [28]:
df[df['B'] > 9]

    A   B   C   D
m  12  13  14  15
n  16  17  18  19

In [30]:
df[(df['B']>9) | (df['B']==1)]

    A   B   C   D
x   0   1   2   3
m  12  13  14  15
n  16  17  18  19